================================================================================
assign - Int
================================================================================

val startYear = 2101

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (primary_expression
        (integer)))))

================================================================================
assign - Float
================================================================================

val pi = 3.14159

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (primary_expression
        (float)))))

================================================================================
assign - String
================================================================================

val name = "kestrel"

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (primary_expression
        (string
          (quoted_content))))))

================================================================================
assign - Type
================================================================================

val debugEnabled = True

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (primary_expression
        (typename)))))

================================================================================
assign - Call
================================================================================

val count = counter(10)

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (primary_expression
        (call
          (reference
            (identifier))
          (argument_list
            (expression
              (primary_expression
                (integer)))))))))

================================================================================
assign - Expression
================================================================================

val sum = 1 + ((2 * 3) / 4)

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (primary_expression
        (binary_operator
          (primary_expression
            (integer))
          (primary_expression
            (parenthesized_expression
              (expression
                (primary_expression
                  (binary_operator
                    (primary_expression
                      (parenthesized_expression
                        (expression
                          (primary_expression
                            (binary_operator
                              (primary_expression
                                (integer))
                              (primary_expression
                                (integer)))))))
                    (primary_expression
                      (integer))))))))))))

================================================================================
assign - Not
================================================================================

val enabled = !False

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (not_operator
        (expression
          (primary_expression
            (typename)))))))

================================================================================
assign - Boolean expression
================================================================================

val open = (count > 10) && (enabled == True) || (debug == False)

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (boolean_operator
        (expression
          (boolean_operator
            (expression
              (primary_expression
                (parenthesized_expression
                  (expression
                    (comparison_operator
                      (primary_expression
                        (identifier))
                      (primary_expression
                        (integer)))))))
            (expression
              (primary_expression
                (parenthesized_expression
                  (expression
                    (comparison_operator
                      (primary_expression
                        (identifier))
                      (primary_expression
                        (typename)))))))))
        (expression
          (primary_expression
            (parenthesized_expression
              (expression
                (comparison_operator
                  (primary_expression
                    (identifier))
                  (primary_expression
                    (typename)))))))))))

================================================================================
assign - Call list
================================================================================

val countriesList = listOf("US", "INDIA", "CANADA")

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (primary_expression
        (call
          (reference
            (identifier))
          (argument_list
            (expression
              (primary_expression
                (string
                  (quoted_content))))
            (expression
              (primary_expression
                (string
                  (quoted_content))))
            (expression
              (primary_expression
                (string
                  (quoted_content))))))))))

================================================================================
assign - Call map
================================================================================

val countryCode = mapOf(
  "in" => "INDIA",
  "us" => "United States",
  "ca" => "Canada"
)

--------------------------------------------------------------------------------

(source
  (assign
    (identifier)
    (expression
      (primary_expression
        (call
          (reference
            (identifier))
          (argument_list
            (pair_argument
              (string
                (quoted_content))
              (expression
                (primary_expression
                  (string
                    (quoted_content)))))
            (pair_argument
              (string
                (quoted_content))
              (expression
                (primary_expression
                  (string
                    (quoted_content)))))
            (pair_argument
              (string
                (quoted_content))
              (expression
                (primary_expression
                  (string
                    (quoted_content)))))))))))
