================================================================================
Class definitions - Simple
================================================================================

package definitions

class AnimalStrong(
  val count: String,
  val userName: Int,
  val currentAddress: Address
)

--------------------------------------------------------------------------------

(source_file
  (package
    (identifier))
  (definitions
    (class_definition
      (definition_name)
      (type_field
        (variable_name)
        (type
          (definition_name)))
      (type_field
        (variable_name)
        (type
          (definition_name)))
      (type_field
        (variable_name)
        (type
          (definition_name))))))

================================================================================
Class definitions - Generic
================================================================================

package definitions

class Bat<S, T>(
  val a: S,
  val b: T
)

--------------------------------------------------------------------------------

(source_file
  (package
    (identifier))
  (definitions
    (class_definition
      (definition_name)
      (generic_list
        (identifier)
        (identifier))
      (type_field
        (variable_name)
        (type
          (definition_name)))
      (type_field
        (variable_name)
        (type
          (definition_name))))))

================================================================================
Class definitions - Traits
================================================================================

package definitions

@B @C
class AnimalSubSpecies (
  val a: String,
  val b: Float
)

--------------------------------------------------------------------------------

(source_file
  (package
    (identifier))
  (definitions
    (class_definition
      (trait_name
        (definition_name))
      (trait_name
        (definition_name))
      (definition_name)
      (type_field
        (variable_name)
        (type
          (definition_name)))
      (type_field
        (variable_name)
        (type
          (definition_name))))))

================================================================================
Class definitions - Genrics + Traits
================================================================================

package definitions

@B @C
class A<S, T>(
  val a: S,
  val b: T
)

--------------------------------------------------------------------------------

(source_file
  (package
    (identifier))
  (definitions
    (class_definition
      (trait_name
        (definition_name))
      (trait_name
        (definition_name))
      (definition_name)
      (generic_list
        (identifier)
        (identifier))
      (type_field
        (variable_name)
        (type
          (definition_name)))
      (type_field
        (variable_name)
        (type
          (definition_name))))))